docs/october-goal-update-1.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://mjgpy3.github.io/me/rss.xml"
      title="RSS feed for https://mjgpy3.github.io/me">
<title>October Challenges Update 1</title>
<meta name="author" content="Michael 'Gilli' Gilliland">
<meta name="referrer" content="no-referrer">
<link href= "static/style.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<!-- Global site tag (gtag.js) - Google Analytics -->
</head>
<body>
<div id="preamble" class="status"><div class="header">
  <a href="https://mjgpy3.github.io/me">Gilli's Land</a>
</div></div>
<div id="content">
<div class="post-date">10 Oct 2022</div><h1 class="post-title"><a href="https://mjgpy3.github.io/me/october-goal-update-1.html">October Challenges Update 1</a></h1>
<p>
Now that it's the 10th, I figured it'd be a good time to post an update on my October challenges! So far they're going well, though it has been difficult to maintain.
</p>

<p>
See the <a href="https://mjgpy3.github.io/me/overly-ambitious-october-challenges.html">original post</a> for more details on exactly what each challenge entails and each challenge's rubric for success.
</p>

<p>
Let's step through were we're at with each challenge.
</p>

<div id="outline-container-org23f7764" class="outline-2">
<h2 id="org23f7764">Challenges</h2>
<div class="outline-text-2" id="text-org23f7764">
</div>
<div id="outline-container-org98eb145" class="outline-3">
<h3 id="org98eb145">Inktober (AKA Drawtober)</h3>
<div class="outline-text-3" id="text-org98eb145">
<p>
I'm pretty happy with my results so far for this challenge. I'm especially happy as one who isn't all that "artistic". I've mostly drawn items from around my house or tried to draw the art of others (for practice, of course). A the end of the month I'll post all may drawings but so far I've managed to do a doodle every day!
</p>

<p>
Here are some teasers of my doodles from the last 9 days:
</p>

<ul class="org-ul">
<li>"Bug-car" from kids' toy</li>
<li>Schema cross</li>
<li>Spooky Pooky</li>
<li>Big Daddy</li>
<li>Penguin &amp; Lil' Pookie</li>
<li>Hobbes stuffie</li>
<li>Endurance</li>
<li>Crest</li>
<li>Lukhimov Ent</li>
</ul>
</div>
</div>

<div id="outline-container-org421e048" class="outline-3">
<h3 id="org421e048">Skateober</h3>
<div class="outline-text-3" id="text-org421e048">
<p>
This challenge has also been a success so far. I certainly haven't been skating as much as usual but I've managed to do "a trick per day". I <span class="underline">have</span> clustered these into a few sessions but that's perfectly acceptable from the challenge description.
</p>

<p>
Here's a playlist of the tricks completed so far: <a href="https://www.youtube.com/playlist?list=PL97kkzI__pGzvRuON8V_JSRg2VgGON7jc">https://www.youtube.com/playlist?list=PL97kkzI__pGzvRuON8V_JSRg2VgGON7jc</a>
</p>
</div>
</div>

<div id="outline-container-org757be1e" class="outline-3">
<h3 id="org757be1e">Booktober</h3>
<div class="outline-text-3" id="text-org757be1e">
<p>
This has been going well and I'm ahead of schedule. I read <i>Making Comics</i> and my brother and I finished <i>As A Man Thinketh</i>. I haven't been reading as much this month, unfortunately, but the other challenges have been fun.
</p>
</div>
</div>

<div id="outline-container-org21d5022" class="outline-3">
<h3 id="org21d5022">Photober</h3>
<div class="outline-text-3" id="text-org21d5022">
<p>
So far this has been a success. Here are teasers of what I've snapped so far:
</p>

<ul class="org-ul">
<li>Wilted rose</li>
<li>Dew on holly</li>
<li>Record spinning</li>
<li>Bug on the ramp</li>
<li>Duck with fish</li>
<li>Hobbes stuffie</li>
<li>Orange tree</li>
<li>Goat</li>
<li>Red green bush</li>
<li>Piano keys</li>
</ul>
</div>
</div>

<div id="outline-container-org6d5a21c" class="outline-3">
<h3 id="org6d5a21c">Psalmtober</h3>
<div class="outline-text-3" id="text-org6d5a21c">
<p>
This is perfectly on target. We've been praying the Psalms each morning.
</p>
</div>
</div>

<div id="outline-container-org9e4dc7e" class="outline-3">
<h3 id="org9e4dc7e">Sober October</h3>
<div class="outline-text-3" id="text-org9e4dc7e">
<p>
Success so far &#x2013; no alcohol since last month!
</p>
</div>
</div>

<div id="outline-container-org344f386" class="outline-3">
<h3 id="org344f386">Hasktober</h3>
<div class="outline-text-3" id="text-org344f386">
<p>
So far so good. I've mostly been reading articles. I'll share which ones at a later date.
</p>
</div>
</div>

<div id="outline-container-orgab08b1f" class="outline-3">
<h3 id="orgab08b1f">Writober</h3>
<div class="outline-text-3" id="text-orgab08b1f">
<p>
This has been going well. I've mostly written private journal entries, however, I also wrote a note to my wife, the original challenge post, a few book reviews (for the year end book review), and this post!
</p>
</div>
</div>

<div id="outline-container-org549eb0d" class="outline-3">
<h3 id="org549eb0d">YouTober</h3>
<div class="outline-text-3" id="text-org549eb0d">
<p>
So far so good. I've already shared the skate trick playlist above but I've also posted 3 or 4 other skateboarding videos that I've been meaning to publish.
</p>
</div>
</div>

<div id="outline-container-org8c7e0e1" class="outline-3">
<h3 id="org8c7e0e1">Langtober</h3>
<div class="outline-text-3" id="text-org8c7e0e1">
<p>
So far so good, DuoLingo every day.
</p>
</div>
</div>

<div id="outline-container-org6f81ce6" class="outline-3">
<h3 id="org6f81ce6">Musictober</h3>
<div class="outline-text-3" id="text-org6f81ce6">
<p>
I've practiced (mainly mandolin) 359 minutes so far. Out of a goal of 930 minutes, I'd say this is ahead of schedule.
</p>
</div>
</div>

<div id="outline-container-org687d583" class="outline-3">
<h3 id="org687d583">Curiousitober</h3>
<div class="outline-text-3" id="text-org687d583">
<p>
This has been good. My only problem has been that I've often delayed the question until the end of the day.
</p>

<p>
So far my questions have been:
</p>

<ul class="org-ul">
<li>Is there a deeper meaning of <i>Blood Meridian</i>?</li>
<li>How did chess come about and develop?</li>
<li>Why do we say "turn over a new leaf"?</li>
<li>Who is "Katari" in Brendan's Death Song?</li>
<li>What is the difference between a crocodile and an alligator?</li>
<li>Where does ALDI USA's food come from?</li>
<li>Why do some classics have names/places blanked out?</li>
<li>What is second person and does anything use it?</li>
<li>How did people greet each other before "hello"?</li>
<li>When is the best time to eat protein (relative to exercise)?</li>
</ul>

<p>
I may later elaborate on each question and post some of the answers I've found.   
</p>
</div>
</div>

<div id="outline-container-org89cc947" class="outline-3">
<h3 id="org89cc947">Exertober</h3>
<div class="outline-text-3" id="text-org89cc947">
<p>
I'm actually ahead of schedule with this one. Since I skated for a while on Sunday I've counted it as a workout which means I've got a few extra skips saved up.
</p>
</div>
</div>

<div id="outline-container-org7e6c0d6" class="outline-3">
<h3 id="org7e6c0d6">Unplugtober</h3>
<div class="outline-text-3" id="text-org7e6c0d6">
<p>
This is going well so far. Aside from a quick daily checkup of email and whatnot I've only been using the internet for very specific purposes. I'm wasting very little time browsing the web which feels great. I may try to make a standard around this challenge &#x2013; we'll see.
</p>
</div>
</div>

<div id="outline-container-org19f3ddf" class="outline-3">
<h3 id="org19f3ddf">Walktober</h3>
<div class="outline-text-3" id="text-org19f3ddf">
<p>
So far so good. I've been counting some very long walks (e.g. we went to the zoo for a few hours) as two walks. This may be cheating but it's hard to get out on a walk in a cold, rainy day.
</p>
</div>
</div>

<div id="outline-container-org7c9c26d" class="outline-3">
<h3 id="org7c9c26d">Voictober</h3>
<div class="outline-text-3" id="text-org7c9c26d">
<p>
We're about half way through <i>iRobot</i> so this challenge is ahead of schedule.
</p>
</div>
</div>

<div id="outline-container-org6828b30" class="outline-3">
<h3 id="org6828b30">Cooktober</h3>
<div class="outline-text-3" id="text-org6828b30">
<p>
I've been cooking large breakfasts almost every day for my family. Due to that and a few extra grill outs and cooking sessions, I'm slightly ahead on this challenge.
</p>
</div>
</div>

<div id="outline-container-org43fdedb" class="outline-3">
<h3 id="org43fdedb">Thriftober</h3>
<div class="outline-text-3" id="text-org43fdedb">
<p>
This is going well. I've only spent $5 on a few books.
</p>
</div>
</div>

<div id="outline-container-org5362c80" class="outline-3">
<h3 id="org5362c80">Churchtober</h3>
<div class="outline-text-3" id="text-org5362c80">
<p>
I had to miss one service due to a family party but this is going fine otherwise.
</p>
</div>
</div>

<div id="outline-container-orgc4130f9" class="outline-3">
<h3 id="orgc4130f9">Whittletober</h3>
<div class="outline-text-3" id="text-orgc4130f9">
<p>
I've managed to rough out a chess pawn each day. So I'd call this a success so far.
</p>
</div>
</div>

<div id="outline-container-org0937188" class="outline-3">
<h3 id="org0937188">Optober</h3>
<div class="outline-text-3" id="text-org0937188">
<p>
This challenge is really difficult to quantify. It's kind of fuzzy and I'm sure I've missed opportunities or been pessimistic on auto-pilot. I think I'm going to do a longer more thought up write up on this at the end of the month. One thing I will say is that the challenge has made me a little more introspective which is, of course, a good outcome.
</p>
</div>
</div>

<div id="outline-container-org0ff65a2" class="outline-3">
<h3 id="org0ff65a2">Brotober</h3>
<div class="outline-text-3" id="text-org0ff65a2">
<p>
I've hung out with my brother (and others in fact) every day so far!
</p>
</div>
</div>

<div id="outline-container-orgc391e21" class="outline-3">
<h3 id="orgc391e21">Gametober</h3>
<div class="outline-text-3" id="text-orgc391e21">
<p>
I'm a little ahead on this one as well. So far I've played:
</p>

<ul class="org-ul">
<li>Chess</li>
<li>Foosball</li>
<li>Pentago</li>
<li>Rummikub</li>
<li>40K mission 1</li>
<li>Zombie Dice</li>
<li>Go fish</li>
<li>Jenga</li>
<li>Solitaire</li>
<li>Pandemic: The Cure</li>
<li>Carcassone</li>
</ul>
</div>
</div>

<div id="outline-container-org993dd9c" class="outline-3">
<h3 id="org993dd9c">Drive Test Tober</h3>
<div class="outline-text-3" id="text-org993dd9c">
<p>
This has been going okay. I've been encouraging my brother to study the driver's manual. I've also been trying to help him with practice tests. We'll see how it works out.
</p>
</div>
</div>

<div id="outline-container-orgd0a78da" class="outline-3">
<h3 id="orgd0a78da">Navy Shower Tober</h3>
<div class="outline-text-3" id="text-orgd0a78da">
<p>
This has been brutal. It's been colder in our house and our water has been colder so this has been quite difficult. I've still managed to avoid hot showers so far but we'll see for how long.
</p>
</div>
</div>

<div id="outline-container-org271f6c0" class="outline-3">
<h3 id="org271f6c0">Dishtober</h3>
<div class="outline-text-3" id="text-org271f6c0">
<p>
A family member did them once while I was away but other than that I've done them multiple times every day.
</p>
</div>
</div>

<div id="outline-container-org87359df" class="outline-3">
<h3 id="org87359df">Caff-free Tober</h3>
<div class="outline-text-3" id="text-org87359df">
<p>
I haven't had any caffeine, intentionally. I guess it's hard to avoid if it's in chocolate and whatnot. But I haven't had any coffee or anything drinks that I know contain caffeine.
</p>
</div>
</div>

<div id="outline-container-orga41ce68" class="outline-3">
<h3 id="orga41ce68">Rectober</h3>
<div class="outline-text-3" id="text-orga41ce68">
<p>
This is well ahead of schedule. I've listened to 20 albums already!
</p>
</div>
</div>
</div>

<div id="outline-container-org4490ec5" class="outline-2">
<h2 id="org4490ec5">Conclusion</h2>
<div class="outline-text-2" id="text-org4490ec5">
<p>
So far everything is going well. As I mentioned, it's difficult to fit everything into a single day. I'm no planning on backing down from these challenges.
</p>
</div>
</div>
<div class="taglist"><a href="https://mjgpy3.github.io/me/tags.html">Tags</a>: <a href="https://mjgpy3.github.io/me/tag-reading.html">reading</a> <a href="https://mjgpy3.github.io/me/tag-books.html">books</a> <a href="https://mjgpy3.github.io/me/tag-skateboarding.html">skateboarding</a> <a href="https://mjgpy3.github.io/me/tag-writing.html">writing</a> <a href="https://mjgpy3.github.io/me/tag-orthodox.html">orthodox</a> <a href="https://mjgpy3.github.io/me/tag-art.html">art</a> <a href="https://mjgpy3.github.io/me/tag-music.html">music</a> <a href="https://mjgpy3.github.io/me/tag-exercise.html">exercise</a> <a href="https://mjgpy3.github.io/me/tag-gaming.html">gaming</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
